
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 3.2 Final//EN" "http://www.w3.org/TR/html4/strict.dtd">
<div>
   
   
   <div>Exercices et applications
      <div><span></span>La 20taine d'exercices activit&eacute;s du document de <a href="more/Algo_Doc_Ress.pdf">ressources</a> publi&eacute; par <a href="http://eduscol.education.fr">&Eacute;duSCOL</a> a &eacute;t&eacute; instanci&eacute;es en <tt><a style="padding:0;margin:0;text-decoration:none" href="http://javascool.gforge.inria.fr">Java'sCool</a></tt> : les "<a href="http://wiki.inria.fr/sciencinfolycee/ProgletSoluce">soluces</a>" (aide syntaxique) sont propos&eacute;es ici (nous <a href="mailto:thierry.vieville@sophia.inria.fr?subject=[javascool] A propos de qq proglet : acc%C3%A8s aux soluce sur [scienceinfolycee]&amp;body=Bonjour,%0a,%20%20Je%20suis%20un%20enseignant%20du%20lyc%C3%A9e%20de%20??%20%C3%A0%20??%20et%20souhaite%20acc%C3%A9der%20aux%20soluces%20des%20proglets.%0a,%20%20%20Voici%20un%20%C3%A9l%C3%A9ment%20qui%20prouve%20que%20je%20ne%20suis%20pas%20%C3%A9l%C3%A8ve%20!%20:%20??%0a,%20%20Signature%20:%20??">contacter</a> pour l'acc&egrave;s). Avec le <a href="#parcours">parcours</a>  pour s'initier &agrave; la programmation, elles permettent de couvrir le programme de 2nd en algorithmique.
      </div>
   </div>
   
   
   
   
   <div>Quelques autres applications, exercices et activit&eacute;s :
      <ul class="ul">
           
         <li>Comprendre le principe de la <a href="sujet-appli-dicho.htm">recherche dichotomique</a>.
         </li>
           
         <li>Programmer quelques <a href="sujet-appli-geometry.htm">calculs g&eacute;om&eacute;triques</a>.
         </li>
           
         <li>D&eacute;couvrir comment marche un <a href="sujet-appli-conva.htm">convertisseur analogique-num&eacute;rique</a>.
         </li>
           
         <li>Comprendre quelques op&eacute;rations de <a href="sujet-appli-image.htm">manipulation d'images</a>.
         </li>
         
      </ul> Note : Aide pour l'enseignant, des <a href="http://wiki.inria.fr/sciencinfolycee/ProgletSoluce">soluces</a> (aide syntaxique) sont propos&eacute;es ici (nous <a href="mailto:thierry.vieville@sophia.inria.fr?subject=[javascool] A propos de quelques proglets : acc%C3%A8s aux solutions sur [scienceinfolycee]&amp;body=Bonjour,%0a,  Je suis un enseignant du lyc%C3%A9e de ?? %C3%A0 ?? et souhaite acc%C3%A9der aux solutions des proglets.%0a,   Voici un %C3%A9l%C3%A9ment qui prouve que je ne suis pas %C3%A9l%C3%A8ve ! : ??%0a,  Signature : ??">contacter</a> pour l'acc&egrave;s).
   </div>
   
   
   
   <div>Cr&eacute;er de nouvelles activit&eacute;s
      <ol class="ol">
           
         <li>Plusieurs proglets<a href="#1" class="note">[.]</a> sont disponibles ici, pour s'initier &agrave; la programmation et cr&eacute;er des exercices anim&eacute;s et interactifs
            <ul class="ul">
                   
               <li>La , 
                  <ul class="ul">
                           
                     <li>utilis&eacute;e pour les apprentissages initiaux des ingr&eacute;dients des algorithmes et</li>
                           
                     <li>tous les exercices qui n&eacute;cessitent des lectures aux clavier comme dans une &laquo;console&raquo;.</li>
                         
                  </ul>
               </li>
                   
               <li>La , 
                  <ul class="ul">
                           
                     <li>utilis&eacute;e pour les exercices qui n&eacute;cessitent un trac&eacute; de courbes o&ugrave; un petit affichage graphique.</li>
                         
                  </ul>
               </li>
                   
               <li>La , 
                  <ul class="ul">
                           
                     <li>utilis&eacute;e pour les exercices qui n&eacute;cessitent de manipuler des images ou des graphismes 2D et une <a href="sujet-appli-image.htm">activit&eacute;</a> sp&eacute;cifique.
                     </li>
                         
                  </ul>
               </li>
                   
               <li>La , utilis&eacute;e pour une <a href="sujet-appli-dicho.htm">activit&eacute;</a> sp&eacute;cifique (recherche dichotomique).
               </li>
                   
               <li>La , utilis&eacute;e pour une <a href="sujet-appli-conva.htm">activit&eacute;</a> sp&eacute;cifique (conversion analogique-num&eacute;rique).
               </li>
                   
               <li>La , simule la &laquo;bonne vieille&raquo; <a href="http://fr.wikipedia.org/wiki/Logo_(langage)">tortue logo</a>, 
                      donc permet de faire beaucoup d'autres activit&eacute;s.
               </li>
                   
               <li>La , est utilis&eacute;e pour des activit&eacute;s (plut&ocirc;t d'un club de maths ou de science, ou lors d'un TPE) de d&eacute;couverte du signal sonore.
                      Nous <a href="#contact">contacter</a> dans ce cas.
               </li>
                 
            </ul>
         </li>
         
         <li>Chaque proglet<a href="#1" class="note">[.]</a> est un <a href="http://fr.wikipedia.org/wiki/Open_source">code source libre</a>, 
            programm&eacute;e en Java et <a href=" ../api/index.html">document&eacute;</a> pour sa libre redistribution, avec un acc&egrave;s au code source, 
            et permettre des d&eacute;veloppements d&eacute;riv&eacute;s.
            
            <div>Un enseignant qui connait un peu de programmation peut facilement d&eacute;velopper ces <a href="../api/index.html">propre proglet's</a>,
               non sans vous inviter &agrave; nous demander (dans la mesure de notre disponibilit&eacute;) de le faire &agrave; partir de votre id&eacute;e, 
               de vous y aider, et nous de faire partager les v&ocirc;tres, etc.
            </div>
         </li>
         
      </ol>
   </div>
   
   
   <div>
        
      <div>Une <tt>proglet</tt> est une petite <a href="http://fr.wikipedia.org/wiki/Applet">applette</a> qui permet de s'initier &agrave; la programmation de mani&egrave;re ludique,
           puisque les petits programmes cr&eacute;&eacute;s animent un &eacute;l&eacute;ment visuel ou sonore, &agrave; la fois pour mieux comprendre ces objets num&eacute;riques
         et pour offrir une d&eacute;marche
           exp&eacute;rimentale concr&egrave;te, vers la compr&eacute;hension des notions abstraites qui forment le fondement des sciences de l'information.
         
           Ces <tt>proglets</tt> sont des exemples de &laquo;<tt>gamelet</tt>&raquo; (c'est &agrave; dire de grains p&eacute;dagogiques interactifs pour un apprentissage ludique d'une notion), 
           telle que d&eacute;finie par <a href="http://fuscia.info">fuscia</a>.
      </div>
        
      <div>Ces documents ne sont pas con&ccedil;us pour apprendre la programmation en "autodidacte" ...
           mais si vous le souhaitez et si vous pouvez dialoguer avec quelqu'un de votre entourage qui sait programmer 
           (afin de ne pas &ecirc;tre bloqu&eacute; sur des d&eacute;tails de syntaxe ou d'impl&eacute;mentation) 
           alors oui : n'h&eacute;sitez pas &agrave; suivre le <a href="#parcours">parcours</a> pour s'initier &agrave; la programmation : 
           vous allez vite &eacute;pater ceux qui pensent &ecirc;tre les seuls &agrave; savoir programmer !
      </div>
        
      <div>Ces ressources ont vocation &agrave; &ecirc;tre publi&eacute;es de mani&egrave;re d&eacute;finitive sur les sites de ressources en ligne auxquels participent
         l'<a href="http://www-inria.fr">INRIA</a>,
           tel que le site <a href="http://interstices.fr">)i(nterstices</a> ou <a href="http://fuscia.info">fuscia</a>, 
           cr&eacute;&eacute;s &agrave; l'initiative de l'<a href="http://www-inria.fr">INRIA</a>. 
           Elles resteront &eacute;videmment accessibles &agrave; partir de cette page.
           Et ... soyons indulgents avec cette 1&egrave;re mise en forme ! Le fond a &eacute;t&eacute; privil&eacute;gi&eacute; &agrave; la forme ici, pour aller &agrave; l'essentiel.
      </div>
      
   </div>
   
</div>