<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta content="text/html;charset=ISO-8859-1" http-equiv="Content-Type">
  <title>algolycee</title>
</head>
<body>
<span style="font-weight: bold;">Algorithmique: </span><span lang="fr"><font
 face="Arial" size="2">copi&eacute;-coll&eacute; de ce qui
``reste&acute;&acute; d'<strike>informatique</strike>d'algorithmique
dans le programme "d&eacute;finitif" de seconde<br>
&nbsp;&nbsp; Ref: </font></span><a class="moz-txt-link-freetext"
 href="http://eduscol.education.fr/D0015/consult_Maths.htm">http://eduscol.education.fr/D0015/consult_Maths.htm</a><br>
<span style="font-weight: bold;"><span style="font-style: italic;">Objectifs
pour le
lyc&eacute;e</span></span><br>
La d&eacute;marche algorithmique est, depuis les origines, une
composante essentielle de l&#8217;activit&eacute; math&eacute;matique. Au
coll&egrave;ge, les &eacute;l&egrave;ves ont rencontr&eacute; des
algorithmes (algorithmes op&eacute;ratoires, algorithme des
diff&eacute;rences, algorithme d&#8217;Euclide, algorithmes de construction
en g&eacute;om&eacute;trie). Ce qui est propos&eacute; dans le
programme est une formalisation en langage naturel propre &agrave;
donner lieu &agrave; traduction sur une calculatrice ou &agrave; l&#8217;aide
d&#8217;un logiciel. Il s&#8217;agit de familiariser les &eacute;l&egrave;ves avec
les grands principes d&#8217;organisation d&#8217;un algorithme : gestion des
entr&eacute;es-sorties, affectation d&#8217;une valeur et mise en forme d&#8217;un
calcul, en op&eacute;rant essentiellement sur des nombres entiers.<br>
Dans le cadre de cette activit&eacute; algorithmique, les
&eacute;l&egrave;ves sont entra&icirc;n&eacute;s :<br>
- &agrave; d&eacute;crire certains algorithmes en langage naturel ou
dans un langage symbolique ;<br>
- &agrave; en r&eacute;aliser quelques uns &agrave; l&#8217;aide d&#8217;un tableur
ou d&#8217;un petit programme r&eacute;alis&eacute; sur une calculatrice ou
avec un logiciel adapt&eacute; ;<br>
- &agrave; interpr&eacute;ter des algorithmes plus complexes.<br>
Aucun langage, aucun logiciel n&#8217;est impos&eacute;.<br>
L&#8217;algorithmique a une place naturelle dans tous les champs des
math&eacute;matiques et les probl&egrave;mes pos&eacute;s doivent
&ecirc;tre en relation avec les autres parties du programme (fonctions,
g&eacute;om&eacute;trie, statistiques et probabilit&eacute;, logique)
mais aussi avec les autres disciplines ou la vie courante.<br>
&Agrave; l&#8217;occasion de l&#8217;&eacute;criture d&#8217;algorithmes et de petits
programmes, il convient de donner aux &eacute;l&egrave;ves de bonnes
habitudes de rigueur et de les entra&icirc;ner aux pratiques
syst&eacute;matiques de v&eacute;rification et de contr&ocirc;le.<br>
<span style="font-weight: bold; font-style: italic;">Instructions
&eacute;l&eacute;mentaires (affectation, calcul, entr&eacute;e, sortie).</span><br>
Les &eacute;l&egrave;ves, dans le cadre d&#8217;une r&eacute;solution de
probl&egrave;mes, doivent &ecirc;tre capables :<br>
- d&#8217;&eacute;crire une formule permettant un calcul ;<br>
- d&#8217;&eacute;crire un programme calculant et donnant la valeur d&#8217;une
fonction ;<br>
ainsi que les instructions d&#8217;entr&eacute;es et sorties
n&eacute;cessaires au traitement.<br>
<span style="font-weight: bold; font-style: italic;">Boucle et
it&eacute;rateur, instruction conditionnelle</span><br>
Les &eacute;l&egrave;ves, dans le cadre d&#8217;une r&eacute;solution de
probl&egrave;mes, doivent &ecirc;tre capables :<br>
- de programmer un calcul it&eacute;ratif, le nombre
d&#8217;it&eacute;rations &eacute;tant donn&eacute; ;<br>
- de programmer une instruction conditionnelle, un calcul
it&eacute;ratif, avec une fin de boucle conditionnelle.<br>
<span style="font-style: italic;"></span><span
 style="font-weight: bold; font-style: italic;">Pr&eacute;sence
d'exemples de mise en &#339;uvre de l'algorithmique dans chacune des trois
parties du programme.</span><br>
<span style="font-style: italic;">- Fonctions</span><br>
&nbsp; * M&ecirc;me si les logiciels traceurs de courbes permettent
d&#8217;obtenir rapidement la repr&eacute;sentation graphique d&#8217;une fonction
d&eacute;finie par une formule alg&eacute;brique, il est
int&eacute;ressant, notamment pour les fonctions d&eacute;finies par
morceaux, de faire &eacute;crire aux &eacute;l&egrave;ves un algorithme
de trac&eacute; de courbe.<br>
<span style="font-style: italic;">- G&eacute;om&eacute;trie</span><br>
&nbsp;* Le cadre de la g&eacute;om&eacute;trie rep&eacute;r&eacute;e
offre la possibilit&eacute; de traduire num&eacute;riquement des
propri&eacute;t&eacute;s g&eacute;om&eacute;triques et permet de
r&eacute;soudre certains probl&egrave;mes par la mise en oeuvre
d&#8217;algorithmes simples. <br>
<span style="font-style: italic;">- Statistiques et probabilit&eacute;s</span><br>
&nbsp;* Utiliser un logiciel (par exemple, un tableur) ou une
calculatrice pour &eacute;tudier une s&eacute;rie statistique (moyenne,
dispersion).<br>
&nbsp;* &Agrave; l&#8217;occasion de la mise en place d&#8217;une simulation, on
peut : utiliser les fonctions logiques d&#8217;un tableur ou d&#8217;une
calculatrice, mettre en place des instructions conditionnelles dans un
algorithme.<br>
&nbsp;* La r&eacute;p&eacute;tition d&#8217;exp&eacute;riences
al&eacute;atoires peut donner lieu &agrave; l&#8217;&eacute;criture
d&#8217;algorithmes (marches al&eacute;atoires).<br>
</body>
</html>



