<!DOCTYPE html PUBLIC "-//IETF//DTD HTML 2.0//EN">
<html>
 <head>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <LINK rel="stylesheet" type="text/css" href="../../doc/style.css">	
  <title>
   Java's Cool Guide Utilisateur : Interface Utilisateur
  </title>
 </head>
 <body>
  <div id="banner">
	  <center><img src="../../doc/banner_guide.jpg" alt="Guide banner" width=60%></center>
  </div>
  <h1><center>Java's Cool Guide Utilisateur : Interface </center></h1>
	<br/>
	<br/>


	<p>
		<div align="center">
			<img src="../../doc/Application.jpg"  alt="Vue de l'application" width=90%>
			<br>
			Vue de l'application Java's Cool.
		</div>
   </p> 

   <p>
	Nous allons d&eacute;tailler chacun des modules qui composent l'interface.
	<br/>
	<h2> <u> <font Color="red">Menu</font> </u></h2>
	De droite &agrave; gauche : <br/><br/>
   
	<h3><u>Fichier</u></h3>
	<br/>
	<img src="../../doc/Fichier.jpg"  alt="Menu Fichier" width=50%>
	</br>
	</br>
	<h4>Nouveau/New :</h4> 
	Permet d’ouvrir une page vierge dans l’&eacute;diteur de texte pour &eacute;crire un nouveau code source. Si une page est d&eacute;j&agrave; ouverte, un onglet appara&icirc;tra avec comme nom ‘TmpX’ où x est un num&eacute;ro. Lors de l’utilisation de ‘nouveau’, la page cr&eacute;e n’existe pas sur le disque dur de l’ordinateur, il faut absolument l'enregistrer. Lors de cette op&eacute;ration, l’enregistrement se fait en mode ‘enregistrer sous‘.
   </br>
	<h4>Ouvrir fichiers/Open files :</h4> 
	<u>Ajouter Dossier :</u>
	Lorsque que l'on clique dessus, une fen&ecirc;tre apparait compos&eacute;e de deux champs &agrave; compl&eacute;ter pour d&eacute;finir un nouveau dossier favoris lequel pourra &ecirc;tre atteint plus rapidement via la liste des dossiers. Le premier champs est le chemin du dossier. Via le bouton chercher situ&eacute; sur sa droite, l'utilisateur peut naviguer dans ses disques durs et dossiers pour trouver celui pour lequel il souhaite un acc&egrave;s rapide ou m&ecirc;me si il le d&eacute;sire cr&eacute;er un nouveau dossier. Le second champ est le nom que l'on souhaite attribuer &agrave; ce raccourci.<br/><br/>
	<u>Supprimer Dossier :</u> 
	D'un clic une fen&ecirc;tre apparait contenant la liste des raccourcis. Il suffit de cocher ceux que l'on souhaite supprimer et de valider.<br/><br/> 
	<u>Liste des dossiers :</u>
	Dans cet espace sont affich&eacute;s tous les raccourcis. Lorsque la souris en survole un, deux choix sont offerts 'sauver sous' ou 'ouvrir'. Chacune des actions amm&egrave;ne directement au dossier qui a &eacute;t&eacute; affect&eacute; au raccourci avec la possibilit&eacute; de sauvegarder en nommant le fichier ou d'ouvrir un fichier source.<br/>
   </br>
	<h4>Fermer/Close :</h4>
   Ferme l’&eacute;diteur en cours (pas l'application). Si jamais le code source contenu dans l’&eacute;diteur a &eacute;t&eacute; modifi&eacute;, un message appara&icirc;t pour avertir l’usager et lui demander si il ne souhaite pas enregistrer les modifications.
	</br>
   <h4>Sauvegarder/Save :</h4>
	Enregistre le code source dans le fichier dont le nom est indiqu&eacute; dans l’onglet de l’&eacute;diteur. Le lieu de l'enregistrement est celui où se situe le fichier.
	</br>
   <h4>Sauvegarder sous/Save as :</h4>
	Permet de nommer et de sp&eacute;cifier l’emplacement du fichier qui contiendra le code source.
	</br>
   <h4>Imprimer/Print :</h4>
	Permet d'imprimer le code source de l'&eacute;diteur actif.
	</br>
   <h4>R&eacute;ouverture/Reopen :</h4> 
	Chaque code source ouvert s'ajoute &agrave; la liste des documents d&eacute;j&agrave; ouverts. Ainsi si l'on ferme l'un d'entre eux et qu'on souhaite l'ouvrir de nouveau, il suffit juste de cliquer sur son nom. 
   </br>
   <h4>Quitter/Exit :</h4> 
	Ferme l'application. Si des fichiers sources n'ont pas &eacute;t&eacute; sauvegard&eacute;s, une proposition de sauvegarde sera faite &agrave; l'usager.
   </br>
   </br>


   <h3><u>Edition</u></h3>
   <br/>
   <img src="../../doc/Edition.jpg"  alt="Menu Edition">
   </br>
   </br>
   <h4>D&eacute;faire/Undo :</h4>
   Permet d’annuler la derni&egrave;re saisie ou manipulation effectu&eacute;e au sein de l’&eacute;diteur (collage ou saisie ). Par exemple si l’on a &eacute;crit : "abc def ghi" et que l’on clique une fois sur d&eacute;faire, on aura l’effacement de 'ghi'. Lors d’un second clic ce sera 'def' qui s’effacera sous condition d’avoir tap&eacute; les mots dans l’ordre.
   <br/>
	<h4>Refaire/redo :</h4>
	Permet de revenir sur un ‘Defaire’. Dans l’exemple au dessus, si l'on se rend compte que l'on a commis un d&eacute;faire de trop, en cliquant sur 'Refaire' une premi&egrave;re fois, on refera appara&icirc;tre au sein de l’&eacute;diteur 'def', une seconde fois c'est 'ghi' qui r&eacute;appara&icirc;tra.
   <br/>
	<h4>Couper/Cut :</h4>
	Lorsque du texte est s&eacute;lectionn&eacute; et que l'on appuie sur 'Couper', ce dernier dispara&icirc;t afin de pouvoir &ecirc;tre coll&eacute; &agrave; un autre endroit. Si deux ‘couper’ sont effectu&eacute;s d’affil&eacute;e les donn&eacute;es du premier ‘couper’ sont perdues.
   <br/>
	<h4>Copier/Copy :</h4>
	A la diff&eacute;rence de ‘Couper’ le texte s&eacute;lectionn&eacute; ne dispara&icirc;t pas.  Le but est le m&ecirc;me.
   <br/>
	<h4>Coller/Paste :</h4>
	Place le texte qui a &eacute;t&eacute; coup&eacute; ou coll&eacute; l&agrave; où se situe le curseur au sein de l’&eacute;diteur de code source.
   <br/>
   <h4>Tout selectionner/Select all :</h4>
	S&eacute;lectionne tous le texte de l’&eacute;diteur en cours afin de pouvoir &ecirc;tre copi&eacute;, coll&eacute; ou m&ecirc;me effac&eacute; en une seule op&eacute;ration.
   <br/> 
	<h4>Trouver-Remplacer/Find-Replace :</h4>
	Permet de trouver un mot dans le texte en d&eacute;plaçant le curseur de l’&eacute;diteur &agrave; chacune de ses apparitions et si besoin est de le remplacer par un autre mot. Le champ remplacer peut &ecirc;tre vide si aucun remplacement n’est souhait&eacute;.  La recherche s’effectue &agrave; partir de la position du curseur en avançant dans le code source (forward), ainsi si il est au milieu et que l’on cherche le mot ‘HelloWorld’, les apparitions de ce dernier pr&eacute;c&eacute;dent le curseur ne seront pas mises en valeur. Il faudra donc faire une recherche en arri&egrave;re (backward) pour les trouver.<br/>
Astuce : Le plus simple lors d’une recherche est d’avoir le curseur au d&eacute;but du document afin d’effectuer une recherche dans toute la page. 
   <br/>
	<h4>Pr&eacute;ferences/Preferences :</h4>
Personnalise la coloration syntaxique selon le choix de l'utilisateur. En cas d'&eacute;garement, il suffit d'utiliser Restore Default pour revenir &agrave; la configuration d'origine.
   <br/>
   </br>

   <h3><u>Bo&icirc;te &agrave; outils</u></h3>
   <br/>
   <img src="../../doc/Boite a outils.jpg"  alt="Menu Boite a outils">
   </br>
   </br>
   Ce menu se remplit de mani&egrave;re dynamique au d&eacute;marrage de l’application &agrave; partir du fichier de configuration des macros. Pour savoir comment ajouter des macros, rendez vous &agrave; la partie d&eacute;di&eacute;e (voir <a href="../confFile/Fichier de configuration.html">Chapitre Configuration)</a>. 
Chacun des menus dans la bo&icirc;te &agrave; outils correspond &agrave; une cat&eacute;gorie. Une fois celle-ci choisie, on a acc&egrave;s au nom de toutes ses fonctions.
En cliquant dessus,  la signature de la fonction s’ajoute l&agrave; où se situe le curseur dans l’&eacute;diteur de code source.
	</br> 
	</br>

   <h3><u>Aide</u></h3>
   <br/>
   <img src="../../doc/Help.jpg"  alt="Menu Aide">
   </br>
   </br>
   <h4>Help Content :</h4> 
	Permet d'acc&eacute;der aux tutoriaux ainsi qu'au guide utilisateur.<br/>
    <br/>
    <img src="../../doc/aide_menu.jpg"  alt="Menu d'aide" width=80%><br/>
    <br/>
	Pour faire apparaître les pages d'aide, il faut cliquer sur le + sur la droite. Il ne reste plus qu'&agrave; choisir la rubrique &agrave; laquelle on veut acc&eacute;der.
   </br>
   
   <h4>A propos de Java's Cool :</h4>
    Donne des renseignements techniques sur l'application.
   <br/>
   <br/>


	<h3><u>Source</u></h3>
	<br/>
	<img src="../../doc/Source.jpg"  alt="Menu Source">
	</br>
    Permet d'acceder &agrave; des fonctionnalit&eacute;s li&eacute;es &agrave; la compilation et &agrave; l'&eacute;x&eacute;cution des programmes.
    </br>
	<h4>Compilation du source</h4> 
	Si l’utilisateur est en mode d&eacute;butant, son code se verra transform&eacute; en java dont le code sera enregistr&eacute; dans un fichier au m&ecirc;me endroit et avec le m&ecirc;me nom que le fichier d'origine &agrave; l'exception de l'extension qui sera .java avant d’&ecirc;tre compil&eacute; par le compilateur JAVAC.<br/> 
Il peut se produire lors de cette op&eacute;ration des messages d’erreurs li&eacute;s au code source si il ne respecte pas certaines r&egrave;gles d’&eacute;criture. Les erreurs seront affich&eacute;es dans la console et pour la plupart traduites en français grâce &agrave; un fichier de configuration qui peut-&ecirc;tre am&eacute;lior&eacute; (voir   <a href="../confFile/Fichier de configuration.html">Chapitre Configuration</a>).
   </br>
   </br>
	<h4>Executer le programme</h4>
	Apr&egrave;s l’avoir compil&eacute;, le programme peut-&ecirc;tre lanc&eacute;. Les r&eacute;sultats s’afficheront dans la console. SI il y a une interaction avec l’utilisateur, il faudra taper les r&eacute;ponses au sein de la console.
	</br>
	</br>
	<h4>Arr&ecirc;t du code programme</H4>
Permet d’arr&ecirc;ter l’ex&eacute;cution  d’un programme  si jamais celui-ci ne r&eacute;pond plus où que l’on se rend compte qu’il ne fait pas ce que l’on souhaite.
   </br>
   </br>

	<h4>Afficher code source java</H4>
Affiche dans la console le code source java g&eacute;n&eacute;r&eacute; à partir du code jvs de l'editeur actif.
   </br>
   </br>


   </br>
   </br>

   <h2> <u> <font Color="orange">Barre d'outils</font> </u></h2>
	
   <img src="../../doc/nouveau.png"  alt="Barre outils : nouveau"> <u>Nouveau/New</u> : Permet d’ouvrir une page vierge dans l’&eacute;diteur de texte pour &eacute;crire un nouveau code source. Si une page est d&eacute;j&agrave; ouverte, un onglet appara&icirc;tra avec comme nom ‘TmpX’ où x est un num&eacute;ro. Lors de l’utilisation de ‘nouveau’, la page cr&eacute;e n’existe pas sur le disque dur de l’ordinateur, il faut absolument l'enregistrer. Lors de cette op&eacute;ration, l’enregistrement se fait en mode ‘enregistrer sous‘.
   </br>
   </br>
   <img src="../../doc/charger.png"  alt="Barre outils : charger"> <u>Ouvrir fichiers/Open files</u> : Lorsque que l'on clique dessus, une fen&ecirc;tre apparait compos&eacute;e de deux champs &agrave; compl&eacute;ter pour d&eacute;finir un nouveau dossier favoris lequel pourra &ecirc;tre atteint plus rapidement via la liste des dossiers. Le premier champ est le chemin du dossier. Via le bouton chercher situ&eacute; sur sa droite, l'utilisateur peut naviguer dans ses disques durs et dossiers pour trouver celui pour lequel il souhaite un acc&egrave;s rapide où m&ecirc;me si il le d&eacute;sire cr&eacute;er un nouveau dossier. Le second champ est le nom que l'on souhaite attribuer &agrave; ce raccourci.<br/><br/>
   Si l'on clique sur la fl&egrave;che &agrave; cot&eacute; du bouton, tous les raccourcis seront affich&eacute;s. Lorsque la souris en survole un, deux choix sont offerts 'sauver sous' ou 'ouvrir'. Chacune des actions am&egrave;ne directement au dossier qui a &eacute;t&eacute; affect&eacute; au raccourci avec la possibilit&eacute; de sauvegarder en nommant le fichier ou d'ouvrir un fichier source.<br/>
   </br>
    <img src="../../doc/Save.png"  alt="Barre outils : sauvegarder"> <u>Sauvegarder/Save </u>: Enregistre le code source dans le fichier dont le nom est indiqu&eacute; dans l’onglet de l’&eacute;diteur. Le lieu de l'enregistrement est celui où se situe le fichier.
   </br>
   </br>
 <img src="../../doc/imprimante.png"  alt="Barre outils : imprimer"> <u>Imprimer/Print</u> : Permet d'imprimer le code source contenu dans l'&eacute;diteur courant.
   </br>
   </br>
<img src="../../doc/Find-replace.png"  alt="Barre outils : trouver remplacer"> <u>Trouver-Remplacer/Find-Replace </u>: Permet de trouver un mot dans le texte en d&eacute;plaçant le curseur de l’&eacute;diteur &agrave; chacune de ses apparitions et si besoin est de le remplacer par un autre mot. Le champ remplacer peut &ecirc;tre vide si aucun remplacement n’est souhait&eacute;.  La recherche s’effectue &agrave; partir de la position du curseur en avançant dans le code source (forward), ainsi si il est au milieu et que l’on cherche le mot ‘HelloWorld’, les apparitions de ce dernier pr&eacute;c&eacute;dent le curseur ne seront pas mises en valeur. Il faudra donc faire une recherche en arri&egrave;re (backward) pour les trouver.<br/>
Astuce : Le plus simple lors d’une recherche est d’avoir le curseur au d&eacute;but du document afin d’effectuer une recherche dans toute la page. 
   
   </br>
   </br>
<img src="../../doc/toolbox.png"  alt="Barre outils : boites &agrave; outils "> <u>Bo&icirc;te &agrave; outils/Toolbox</u> : Il faut cliquer sur la fl&egrave;che &agrave; cot&eacute; de l'icone. Ce menu se remplit de mani&egrave;re dynamique au d&eacute;marrage de l’application &agrave; partir du fichier de configuration des macros. Pour savoir comment ajouter des macros, rendez vous &agrave; la partie d&eacute;di&eacute;e (voir <a href="../confFile/Fichier de configuration.html">Chapitre Configuration)</a>. 
Chacun des menus dans la bo&icirc;te &agrave; outils correspond &agrave; une cat&eacute;gorie. Une fois celle-ci choisie, on a acc&egrave;s au nom de toutes ses fonctions et <font color="yellow">lorsqu’on laisse le curseur sur l’une d’entre elles,  une courte description de ses effets appara&icirc;t.</font>
En cliquant dessus,  la signature de la fonction s’ajoute l&agrave; où se situe le curseur dans l’&eacute;diteur de code source.
   </br>
   </br>
<img src="../../doc/compile.png"  alt="Barre outils : compiler "> <u>Compiler/Compile</u>  : Si l’utilisateur est en mode d&eacute;butant, son code se verra transform&eacute; en java dont le code sera enregistr&eacute; dans un fichier au m&ecirc;me endroit et avec le m&ecirc;me nom que le fichier d'origine &agrave; l'exception de l'extension qui sera .java avant d’&ecirc;tre compil&eacute; par le compilateur JAVAC.<br/> 
Il peut se produire lors de cette op&eacute;ration des messages d’erreurs li&eacute;s au code source si il ne respecte pas certaines r&egrave;gles d’&eacute;criture. Les erreurs seront affich&eacute;es dans la console et pour la plupart traduites en français.
   </br>
   </br>
<img src="../../doc/execute.gif"  alt="Barre outils : executer "> <u>Executer/Execute</u> : Apr&egrave;s l’avoir compil&eacute;, le programme peut-&ecirc;tre lanc&eacute;. Les r&eacute;sultats s’afficheront dans la console. SI il y a une interaction avec l’utilisateur, il faudra taper les r&eacute;ponses au sein de la console.
</br>
</br>
   </br>
<img src="../../doc/inspecteur.png"  alt="Barre outils : inspecter "> <u>Inspecter/Check</u> : Lors de l’ex&eacute;cution du programme, il est possible de conna&icirc;tre &agrave; tout instant la valeur d’une variable afin de pouvoir comprendre, en cas d’erreur ou de r&eacute;sultat incongru, &agrave; quel moment cela se d&eacute;roule.
   </br>
   </br>
<img src="../../doc/stop.gif"  alt="Barre outils : stop "> <u>Stop</u> : Permet d’arr&ecirc;ter l’ex&eacute;cution  d’un programme  si jamais celui-ci ne r&eacute;pond plus où que l’on se rend compte qu’il ne fait pas ce que l’on souhaite.
   </br>
   </br>
	<br/>

   <h2> <u> <font Color="blue">Editeur</font> </u></h2>
	L'&eacute;diteur est le cadre dans lequel l'utilisateur peut &eacute;crire le code source de son programme.
	Il dispose de la coloration syntaxique (coloration des mots clefs comme 'int'), de l'auto-indentation qui rend le code plus lisible (sur l'image l'appel de fonction 'afficher' est d&eacute;cal&eacute; par rapport &agrave; 'int main'), de l'auto-compl&eacute;tion des accolades et de leur surbrillance deux &agrave; deux (un carr&eacute; mauve entoure l'accolade pr&egrave;s de HelloWorld car le curseur de la souris se trouve sur la derni&egrave;re accolade, on sait ainsi ce que ferme l'accolade) .
	<br/>
	<br/>



   <h2> <u> <font Color=ea00f6>Console</font> </u></h2>
    Elle affiche des informations li&eacute;es &agrave; la compilation et &agrave; l’ex&eacute;cution du programme. Dans notre programme exemple, l'ex&eacute;cution a entra&icirc;n&eacute; l'affichage de "Hello World !".<br/>
	Une barre de boutons est visible &agrave; cot&eacute; de l'onglet de la console : <img src="../../doc/Console_barre_bouton.jpg"  alt="barre des boutons de la console"><br/>
    Seule la premi&egrave;re icone est utile, il s'agit de  'Clear Console'.<br/>
	Cela efface tout ce qu'il y a d'&eacute;crit au sein de la console. En v&eacute;rit&eacute;, il est juste &eacute;crit &agrave; l'int&eacute;rieur de la console une page de lignes vides. Ainsi en remontant avec la barre de d&eacute;filement, on peut retrouver d'anciennes inscriptions lors d'une m&ecirc;me utilisation.<br/>
	Les autres icones sont inactives, exception faite de la derni&egrave;re qui permet d'ouvrir de nouvelles consoles dont le contenu sera identique &agrave; la premi&egrave;re.
	<br/>
	

   </P>

 <br/>
 <br/>
 <div id="prev">
 <a href="../install/Installation.html"> < Installation</a>
 </div>
 <div id="next">
  <a href="../confFile/Fichier de configuration.html"> Fichier de configuration > </a>
 </div>
 </body>
</html>