
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<div>
   <h2>D&eacute;couvrir les ingr&eacute;dients des algorithmes.</h2>
   
   
   <div>
      <h2>Un parcours pour s'initier &agrave; la programmation.</h2>
      Ce parcours permet de s'approprier les cinq ingr&eacute;dients des algorithmes (en <a href="http://javascool.gforge.inria.fr/v3/javascool.jar">lan&ccedil;ant javascool</a>):
         
      <p>
         <table align="center" width="90%" cellpadding="5px" bgcolor="#eeeeee" class="table">
                 
            <tr>
               <td valign="top"><b>Utiliser des <a href="sujet-hello-world.htm">s&eacute;quences d'instructions</a>.</b></td>
            </tr>
                 
            <tr>
               <td valign="top"><b>Apprendre &agrave; se servir de <a href="sujet-about-variables.htm">variables</a>.</b></td>
            </tr>
                 
            <tr>
               <td valign="top"><b>D&eacute;couvrir l'instruction <a href="sujet-about-if.htm">conditionnelle</a>.</b></td>
            </tr>
                 
            <tr>
               <td valign="top"><b>Se familiariser avec les <a href="sujet-about-functions.htm">fonctions</a>.</b></td>
            </tr>
                 
            <tr>
               <td valign="top"><b>Programmer avec des <a href="sujet-about-while.htm">boucles</a>.</b></td>
            </tr>
               
         </table><br></p>
         
      <div>avec un <a href="about-memo.htm">m&eacute;morandum</a> des constructions et instructions, et la <a href="about-proglet.htm">proglet</a> "console".
      </div>
        
   </div>
   
     
   <div>
      <h2>La diff&eacute;rence entre une machine &agrave; caf&eacute; et un ordinateur.</h2>
      Nous savons qu'un ordinateur peut effectuer des op&eacute;rations tr&egrave;s vari&eacute;es sur des types de donn&eacute;es tr&egrave;s vari&eacute;es,
      c'est une machine compl&egrave;tement polyvalente : tous les automatismes peuvent &ecirc;tre programm&eacute;s sur un ordinateur, 
      . . &agrave; l'inverse des machines &agrave; caf&eacute; ou des machines &agrave; laver, qui servent &agrave; une seule chose.
      Mais si la machine &agrave; caf&eacute; peut "m&eacute;caniquement" faire le caf&eacute; d&egrave;s sa sortie de l'usine, 
          un ordinateur ne sait quasiment rien faire.  Un ordinateur doit "&ecirc;tre programm&eacute;" pour retoucher une photo, la mettre sur
      un blog ou un site web, ...
          C'est pour cela que les ordinateurs ont besoin de programmes. 
          
      <div>Ce qui est vraiment remarquable c'est que tous les programmes du monde peuvent s'&eacute;crire &agrave; partir de cinq ingr&eacute;dients et nous
         allons d&eacute;couvrir ces ingr&eacute;dients, 
             ici, &agrave; partir d'un exemple tr&egrave;s concret. Nous saurons alors programmer tous les algorithmes du monde.
      </div>
        
   </div>
   
     
   <div id="1">
      <h2>Des documents (sur le web) pour apprendre et se cultiver sur le sujet.</h2>
      <ul class="ul">
             
         <li>Le poly de cours pour <a href="http://interstices.info/ingredients-algorithmes">d&eacute;couvrir les ingr&eacute;dients des algorithmes</a>.
         </li>
             
         <li>Les documents <a href="http://interstices.info/algo-mode-emploi">Algorithme mode d'emploi</a> et 
                  <a href="http://interstices.info/demandez-le-programme">Demandez le programme</a> offrent une introduction &agrave; l'&eacute;l&egrave;ve ce sujet.
         </li>
             
         <li>Pour le professeur: Une <a href="rtsp://stream-serv.inrialpes.fr/Roc/SeminaireInformatiqueObjetsNumeriques/G_Dowek.rm">pr&eacute;sentation vid&eacute;o</a> 
                  accompagn&eacute;e de ses <a href="http://javascool.gforge.inria.fr/v3/documents/slides-dowek.pdf">supports</a> donne les fondements de cette le&ccedil;on.
         </li>
           
      </ul>
   </div>
   
     
   <div>
      <h2>Pour aller plus loin (sur le web)..</h2>
      <ul class="ul">
             
         <li>D&eacute;couvrir <a href="http://interstices.info/turing">Alan Turing</a>, "le" pionnier de l'informatique et 
                 sur la diff&eacute;rence entre <a href="http://interstices.info/calculer-penser">calculer (avec un ordinateur) et penser (avec un cerveau)</a>.
         </li>
             
         <li>Faire des exercices d'<a href="../../exosdemaths/doc-files/index.htm">algoritmhique du programme de math&eacute;matique de seconde</a>.
         </li>
             
         <li>D&eacute;couvrir le <a href="../../dichotomie/doc-files/index.htm">principe algoritmhique de la dichotomie</a>.
         </li>
           
      </ul>
   </div>
   
</div>