
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<div align="right"></div>
<div class="sujet">
   <h2>Un tutoriel sur les signaux sonores.</h2> 
   
   <h2>Objectif.</h2>
   <div class="objectif">
      Le but de ce tutoriel est de . . 
      Il faut d&eacute;ja savoir <a href="../../ingredients/doc-files/sujet-hello-world.htm">utiliser l'interface</a>,
          se servir de <a href="../../ingredients/doc-files/sujet-about-variables.htm">variables</a> 
          et avoir d&eacute;couvert l'<a href="../../ingredients/doc-files/sujet-about-if.htm">instruction conditionnelle</a> et 
          les <a href="../../ingredients/doc-files/sujet-about-while.htm">boucles</a>, 
          ansi que les <a href="../../ingredients/doc-files/sujet-about-functions.htm">fonctions</a>..
        
   </div>
     
   <h2>Introduction.</h2>
   <div id="intros">
      <ol>
         <li>
            <div>
               <h3>La notion de signal p&eacute;riodique.</h3> Une note est une vibration . . [r&eacute;sumer le tete de C&eacute;cile] 
                   comme <a href="OndeSonore.pdf">d&eacute;taill&eacute; ici</a> (bien lire le dcouemtn avant de commencer).
                 
            </div>
         </li>
      </ol>
   </div>
   
     
   <h2>Travail propos&eacute;.</h2>
   <div id="works">
      <ol>
         <li>
            <div>
               <h3>faire un truc.</h3>
               
               1.	Dans un premier temps, on peut laisser manipuler l'interface qui pr&eacute;sente une voiture dans un environnement 3D. Les 4 diff&eacute;rentes
               fl&egrave;ches permettent la navigation. Cette vue est compl&eacute;t&eacute;e par une repr&eacute;sentation 2D (type a&eacute;rienne) de l'environnement et
               des mouvements du v&eacute;hicule. Dans cet environnement, peuvent &ecirc;tre ajout&eacute;s des "stations" (spots), soit par touche 'a' pour
               les g&eacute;n&eacute;rer toutes en une seule fois et de mani&egrave;re al&eacute;atoire, soit par clic droit et la station apparaitra &agrave; la position courante
               de la voiture. Les stations apparaissent en orange dans les deux repr&eacute;sentations. 
               
               OBJECTIF: En fixant une station de d&eacute;part et une station d'arriv&eacute;e, l'objectif de la voiture est de passer par toutes les
               stations en minimisant la distance parcourue (et oui, l'impact carbone..).
               
               2.	On propose que l'&eacute;l&egrave;ve cherche le plus court chemin par d&eacute;duction. Il ballade la voiture de station en station et par un
               'clic centre + rel&acirc;che' m&eacute;morise le chemin. La distance est alors automatiquement calcul&eacute;e.
               
               3.	On propose de programmer par l'interm&eacute;diaire de la proglet.
                   
            </div>
         </li>
      </ol>
   </div>
   
</div>