
<!-- AUTOMATICALLY GENERATED: DO NOT EDIT ! --><div>
   
   <h2>Des propositions d'interventions de scientifiques</h2> 
   
     
   <p>
      <table border="1">
             
         <tr class="titre">
                  
                  
            <td id="title">Th&egrave;me</td>
                  
            <td id="type">Type</td>
                  
            <td id="target">Niveau</td>
                  
                  
                  
            <td id="what">Descriptif</td>
                
         </tr>
         
             
         <tr class="">
                  
                  
                  
                  
            <td id="title">NATOCELL: anatomie de la cellule</td>
                  
            <td id="type">F&ecirc;te de la science et toute manifestation &agrave; caract&egrave;re scientifique aupr&egrave;s de la jeunesse</td>
                  
            <td id="target">Coll&egrave;ge et lyc&eacute;e, classe de SVT, ES, S</td>
                  
            <td id="what">Notre corps compte plusieurs milliards de cellules qui nous aident &agrave; bouger, &agrave; respirer... &agrave; vivre! Cependant, le public conna&icirc;t
               mal cet &eacute;l&eacute;ment indispensable au bon fonctionnement de chaque &ecirc;tre vivant. Il s'agit de mettre &agrave; la disposition du grand public
               <i>un objet &laquo;cellule&raquo;</i>, grossit des milliers de fois, r&eacute;alis&eacute; en mat&eacute;riaux synth&eacute;tiques qui permettra d'informer les publics scolaires sur l'organisation
               de la cellule, sa vie, ses dysfonctionnements, sa r&eacute;paration quand elle est malade et surtout comment la recherche scientifique
               nourrit de formidables espoirs pour la soigner. Cet objet p&eacute;dagogique pourra &ecirc;tre utilis&eacute; comme support de cours en SVT ou
               pr&eacute;sent&eacute; aux publics scolaires notamment lors de la &laquo;F&ecirc;te de la Science&raquo;. Il aura pour but de familiariser et sensibiliser
               le public &agrave; cette unit&eacute; de base du vivant.
            </td>
                
         </tr>
         
             
         <tr class="">
                  
                  
                  
            <td id="title">Tous les m&eacute;tiers de la recherche scientifique: du soigneur d'animaux &agrave; la math&eacute;maticienne</td>
                  
            <td id="type">Conf&eacute;rence-d&eacute;bat</td>
                  
            <td id="target">Lyc&eacute;e et Coll&egrave;ge</td>
                  
                  
                  
            <td id="what">La recherche et l'innovation seront s&ucirc;rement les moteurs de notre soci&eacute;t&eacute; face au grands d&eacute;fis que nous connaissons: 
                     environnement, &eacute;nergie, d&eacute;mographie, mondialisation. Cette recherche scientifique est un sujet bien trop s&eacute;rieux pour
               &ecirc;tre confi&eacute;e au scientifiques . . sans 
                     le support de beaucoup d'autres m&eacute;tiers: administrateurs, juristes, techniciens et ing&eacute;nieurs, philosophes, etc.. Il
               y a tellement &agrave; faire, ensemble, que 
                     les op&eacute;rateurs qui font de la recherche scientifique dans le domaine public ou priv&eacute;, offrent les plus innatendus des
               m&eacute;tiers: &agrave; d&eacute;couvrir !
            </td>
                
         </tr>
         
             
         <tr class="">
                  
                  
                  
            <td id="title">Traitement num&eacute;rique de la g&eacute;om&eacute;trie</td>
                  
            <td id="type">Conf&eacute;rence avec d&eacute;monstrations logicielles</td>
                  
            <td id="target">Lyc&eacute;e</td>
                  
                  
                  
            <td id="what">Apr&egrave;s le texte, le son et les images, les mod&egrave;les g&eacute;om&eacute;triques sont identifi&eacute;s comme la &laquo;quatri&egrave;me vague&raquo; du multim&eacute;dia par
                     les acteurs de l'informatique graphique, et sont devenus un sujet d'&eacute;tude central pour les acteurs de l'ing&eacute;nierie num&eacute;rique.
               Ce
                     succ&egrave;s n'a &eacute;t&eacute; possible que gr&acirc;ce &agrave; un travail th&eacute;orique et algorithmique consid&eacute;rable effectu&eacute; dans le domaine du traitement
               du
                     signal. D'un point de vue scientifique, le nouveau d&eacute;fi consiste &agrave; &eacute;laborer les fondements th&eacute;oriques et algorithmiques
               pour
                     construire un ensemble de techniques similaires aux outils du traitement num&eacute;rique du signal, mais pour la g&eacute;om&eacute;trie.
               Par
                     analogie avec les signaux sonores ou les images, on cherchera &agrave; mesurer, reconstruire, traiter, comprimer et transmettre
               des
                     formes complexes
            </td>
                
         </tr>
         
             
         <tr class="">
                  
                  
                  
            <td id="title">Le Sudoku: un tr&egrave;s bel exercice de calcul pour un ordinateur !</td>
                  
            <td id="type">Conf&eacute;rence avec d&eacute;monstrations logicielles</td>
                  
            <td id="target">Lyc&eacute;e</td>
                  
                  
                  
            <td id="what">Exemples de probl&egrave;mes d'algorithmique de th&eacute;orie des graphes : construction d'un r&eacute;seau de degr&eacute; et diam&egrave;tre donn&eacute;s ou d'un
                     r&eacute;seau embarqu&eacute; tol&eacute;rant aux pannes, comment trouver les plus courts chemins dans un r&eacute;seau.
                     Et comment des m&eacute;canismes similaires permettent de se repr&eacute;senter les r&egrave;gles plus ou moins difficiles 
                     (les r&egrave;gles logiques et celles bas&eacute;es sur la th&eacute;orie des graphes) pour r&eacute;soudre un sudoku.
            </td>
                
         </tr>
         
             
         <tr class="">
                  
                  
                  
            <td id="title">Nos r&eacute;seaux t&eacute;l&eacute;phoniques et informatiques marcheraient jamais sans les math&eacute;matiques</td>
                  
            <td id="type">Conf&eacute;rence avec d&eacute;monstrations logicielles</td>
                  
            <td id="target">Lyc&eacute;e</td>
                  
                  
                  
            <td id="what">Exemples de probl&egrave;mes d'algorithmique de th&eacute;orie des graphes : construction d'un r&eacute;seau de degr&eacute; et diam&egrave;tre donn&eacute;s ou d'un
                     r&eacute;seau embarqu&eacute; tol&eacute;rant aux pannes, comment trouver les plus courts chemins dans un r&eacute;seau.
                     Et comment des m&eacute;canismes similaires permettent de se repr&eacute;senter les r&egrave;gles plus ou moins difficiles en t&eacute;l&eacute;com.
            </td>
                
         </tr>
         
             
         <tr class="">
                  
                  
                  
            <td id="title">Du r&ocirc;le scientifique et industriel des math&eacute;matiques appliqu&eacute;es</td>
                  
            <td id="type">Conf&eacute;rence d&eacute;bat</td>
                  
            <td id="target">Lyc&eacute;e</td>
                  
                  
                  
            <td id="what">O&ugrave; l'on montrera que l'on peut devenir fort riche gr&acirc;ce aux math&eacute;matiques. Riche d'argent: ces ont en effet les plus belles
               math&eacute;matiques actuelles, 
                     celles li&eacute;es &agrave; la th&eacute;orie des probabilit&eacute;s, qui permettent de faire avancer la science au niveau des math&eacute;matiques financi&egrave;res,
               par exemple
                     calculer comment g&eacute;rer au mieux des produits financiers malgr&eacute; les al&eacute;ats des march&eacute;s. Riche &eacute;conomiquement: car les
               grandes technologies industrielles
                     &eacute;mergentes, celles qui nous feront aller de l'avant, utilisent les vraies math&eacute;matiques, celles que l'on peut appliquer.
            </td>
                
         </tr>
         
             
         <tr class="">
                  
                  
                  
            <td id="title">Analyse d'images biomedicales par ordinateur: la simulation du fonctionnement du coeur en mouvement.</td>
                  
            <td id="type">D&eacute;monstration sur stand ou lors d'une visite, sujet de d&eacute;bat</td>
                  
            <td id="target">Lyc&eacute;e</td>
                  
                  
                  
            <td id="what">L'objectif de ce projet est de fournir un modele anatomique et fonctionnel du coeur permettant l'assimilation de donn&eacute;es des
               patients et 
                     la planification de th&eacute;rapies assez critiques comme l'ablation de parties du coeur pour &eacute;viter les "crises cardiaques".
               Au del&agrave; de r&eacute;sultats fascinants,
                     il y a des enjeux vertigineux sur le confort medical de tout un chacun, sur le report &eacute;ventuel de notre future mort
               et le co&ucirc;t qui peut-&ecirc;tre sans limite aussi.
            </td>
                
         </tr>
         
             
         <tr class="">
                  
                  
                  
            <td id="title">La robotique</td>
                  
            <td id="type">Conf&eacute;rence avec d&eacute;monstrations logicielles</td>
                  
            <td id="target">Lyc&eacute;e</td>
                  
                  
                  
            <td id="what">A d&eacute;couvrir comment la r&eacute;solution d'&eacute;quations s'applique &agrave; des techniques de r&eacute;solution des probl&egrave;mes quotidiens et &agrave; la robotique.</td>
                
         </tr>
         
             
         <tr class="">
                  
                  
                  
            <td id="title">La vision des robots (st&eacute;r&eacute;ovision artificielle, vision humaine, d&eacute;tection de mouvement)</td>
                  
            <td id="type">Conf&eacute;rence avec d&eacute;monstrations logicielles</td>
                  
            <td id="target">Lyc&eacute;e</td>
                  
                  
                  
            <td id="what">D&eacute;couvrir ce que les calculs d'ordinateurs peuvent extraire d'une image, des informations sur la g&eacute;om&eacute;trie de la sc&egrave;ne, les
               mouvements, etc.. 
                     En comprendre aussi les limites et les enjeux des recherches futures sur le sujet.
            </td>
                
         </tr>
         
             
         <tr class="">
                  
                  
                  
            <td id="title">La moiti&eacute; des exos de maths se fait automatiquement sur ordinateur: pourquoi diable se prendre la t&ecirc;te apr&egrave;s ?</td>
                  
            <td id="type">Conf&eacute;rence avec d&eacute;monstrations logicielles</td>
                  
            <td id="target">Lyc&eacute;e, 1&egrave;re S</td>
                  
                  
                  
            <td id="what">Beaucoup de "calculs symboliques" (d&eacute;velopper une expression, r&eacute;soudre une &eacute;quation, &eacute;tudier une fonction, ..) sont tellement
               m&eacute;caniques . . que 
                     vous pouvez les faire automatiquement sur un logiciel comme Maple ou Mathematica. Ne vous en privez pas ! Car trois
               choses merveilleuses vont se produire:
                     (i) vous allez pouvoir consacrer votre temps &agrave; faire autre chose, (ii) vous serez "bons en maths" m&ecirc;me si vous d&eacute;testez
               &ccedil;a, (iii) vous allez "comprendre" des
                     tas de choses qui parraissaient r&eacute;barbatives avant ! Fini d'&ecirc;tre l'esclave des math&eacute;matiques, devenez le boss ! D'ailleurs
               quand les scientifiques en sont &agrave;
                     calculer un Airbus A380 ou ce que fait le cerveau d'un lapin, aucune chance de pouvoir faire ces quelques si&egrave;cles de
               calcul &agrave; la main. Regardons ensemble
                     ce qui peut &ecirc;tre m&eacute;canis&eacute; en math&eacute;matiques et ce que seul le cerveau peut appr&eacute;hender.
            </td>
                
         </tr>
         
             
         <tr class="">
                  
                  
                  
            <td id="title">La grenouille et le robot: qui est le moins sot ?</td>
                  
            <td id="type">Conf&eacute;rence et d&eacute;bat avec les &eacute;l&egrave;ves</td>
                  
            <td id="target">Lyc&eacute;e</td>
                  
                  
                  
            <td id="what">Quand une grenouille gobe une mouche, c'est fascinant ! La grenouille gobe la mouche non pas o&ugrave; elle elle la voit, mais l&agrave;
               o&ugrave; sera la mouche &agrave; la fin
                     du saut de la grenouille: d&eacute;tection du mouvement de la mouche, pr&eacute;diction de sa position future, auto-calibration de
               la bio-m&eacute;canique de la grenouille, 
                     voil&agrave; un m&eacute;canisme des plus sophistiqu&eacute;. Ok. Maintenant si un petit caillou est jet&eacute; devant la grenouille . . elle le
               gobe avec autant d'allant !!! 
                     Sophistiqu&eacute;, mais tr&egrave;s con. Le robot &agrave; ses chances, la vision des robots a beau ne pas &ecirc;tre intelligente, elle leur
               permet de faire bien plus que vous ne 
                     pourriez penser.
            </td>
                
         </tr>
         
             
         <tr class="">
                  
                  
                  
            <td id="title"></td>
                  
            <td id="type"></td>
                  
            <td id="target"></td>
                  
                  
                  
            <td id="what"></td>
                
         </tr>
         
          
      </table>
   </p>
   
</div>